;Установка IM2 и нового вектора прерываний
;DE - обработчик прерываний
set_im2:
        ;устанавливаем адрес процедуры перехватчик прерываний
	; LD	de,im2_handler
	LD	hl,#80FF
	LD	(hl),e
	INC	hl
	LD	(hl),d

	;запуск режима IM2
	LD	a,i           	;сохранение
	LD	(set_im1.save_i),a  ;     регистра прерываний
	LD	a,#80
	DI
	LD	i,a		;i=#80
	IM	2
	EI
        ret
;Восстановление режима IM1 и предыдущего значения вектора прерываний
set_im1:
        di
        ld      a,0
.save_i: equ    $-1
        ld      i,a
        im      1
        ei
        ret

